### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:6",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:7" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:7/invocations" -> (known after apply)
        tags                           = {}
!       version                        = "7" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "7" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3648184802372906169" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691599049283176000" -> "1691605160458228200"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:6" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-09T16:38:54.521+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:6" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_key                      = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
!       s3_object_version           = "yONgCXcv6NwzltQD.h8T5yS8g1Sgj0Zf" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "6zEZsj89RhVQQ2vY0ZlQVrjQH2ankkLbOjsvZXt2m0I=" -> (known after apply)
!       source_code_size            = 1176 -> (known after apply)
!       version                     = "6" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "5af66f6e6b529ae4fce0e9a4023b90ed" -> (known after apply)
!       id                     = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> (known after apply)
!       key                    = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "yONgCXcv6NwzltQD.h8T5yS8g1Sgj0Zf" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function/",
+                       null,
                    ],
                ]
+               filename      = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1492612178095317059" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
!           "timestamp" = "1691599049268632000" -> "1691605160439657000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "4777062198179577835" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/4eccd2ccc9b1692de3d9ee47ae93f4ad43220c5c7c1959cd24aa655a6ee85b7a.zip" -> "builds/c159cfb81bd75fba03050722b1f2acbedd7e0c5524338805e6b1e29a14d7c1f6.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>